added a clean diagram
